app/Services/JWTService.php

INSERT INTO "refresh_tokens" ("user_id", "token_hash", "expires_at", "revoked", "created_at") VALUES (3, '9354db17efb7ae974fe44e89b58e495537963e9e82504d7414bdc7eb60a4f0a6', '2026-05-18 14:27:45', FALSE, '2026-04-18 14:27:45')
---
    public function generateRefreshToken(int $userId): string
    {
        $token     = bin2hex(random_bytes(40));
        $tokenHash = hash('sha256', $token);

        model(RefreshTokenModel::class)->insert([
            'user_id'    => $userId,
            'token_hash' => $tokenHash,
            'expires_at' => date('Y-m-d H:i:s', time() + $this->refreshTtl),
            'revoked'    => false,
            'created_at' => date('Y-m-d H:i:s'),
        ]);