app/Controllers/Api/AuthController.php

INSERT INTO "users" ("name", "email", "password", "created_at", "updated_at") VALUES ('Test User', 'test@test.com', '$2y$10$QZq3VJXsQHd79wAE0YX5Y.O8Ux5jPfQaTgvpxVxs4F82/yhasfwNG', '2026-04-18 14:27:45', '2026-04-18 14:27:45')
SELECT *
FROM "users"
WHERE "users"."id" = 3
---
    public function register(): ResponseInterface
    {
        $rules = [
            'name'     => 'required|min_length[2]|max_length[150]',
            'email'    => 'required|valid_email|max_length[255]|is_unique[users.email]',
            'password' => 'required|min_length[8]|max_length[100]',
        ];

        $input = $this->request->getJSON(true) ?? $this->request->getPost();

        if (! $this->validateData($input ?? [], $rules)) {
            return $this->validationError($this->validator->getErrors());
        }

        $userId = $this->userModel->insert([
            'name'     => trim($input['name']),
            'email'    => strtolower(trim($input['email'])),
            'password' => password_hash($input['password'], PASSWORD_BCRYPT),
        ], true);

        if (! $userId) {
            return $this->error('No se pudo crear el usuario.', 500);
        }

        $user         = $this->userModel->find($userId);