app/Controllers/Api/ListController.php

    public function create(): ResponseInterface
    {
        $rules = [
            'name'        => 'required|min_length[1]|max_length[150]',
            'description' => 'permit_empty|max_length[1000]',
            'is_public'   => 'permit_empty',
        ];

        $input = $this->request->getJSON(true) ?? $this->request->getPost();

        if (! $this->validateData($input ?? [], $rules)) {
            return $this->validationError($this->validator->getErrors());
        }

        $listId = $this->listModel->insert([
            'user_id'     => $this->currentUserId(),
            'name'        => trim($input['name']),
            'description' => trim($input['description'] ?? ''),
            'is_public'   => filter_var($input['is_public'] ?? false, FILTER_VALIDATE_BOOLEAN),
        ], true);

        if (! $listId) {
            return $this->error('No se pudo crear la lista.', 500);
        }

        $list = $this->listModel->find($listId);
---
INSERT INTO "user_lists" ("user_id", "name", "description", "is_public", "created_at", "updated_at") VALUES (3, 'Mis favoritas', 'Lista de prueba', FALSE, '2026-04-18 15:02:30', '2026-04-18 15:02:30')
SELECT *
FROM "user_lists"
WHERE "user_lists"."id" = 4

            return $this->error('No se proporcionaron campos para actualizar.', 400);
        }

        $this->listModel->update($listId, $updateData);

        return $this->success($this->listModel->find($listId), 'Lista actualizada.');
---
UPDATE "user_lists" SET "name" = 'Nombre actualizado', "updated_at" = '2026-04-18 15:30:46'
WHERE "user_lists"."id" IN (1)
SELECT *
FROM "user_lists"
WHERE "user_lists"."id" = 1

    public function delete($id = null): ResponseInterface
    {
        $listId = (int) $id;
        if (! $this->listModel->belongsToUser($listId, $this->currentUserId())) {
            return $this->error('Lista no encontrada.', 404);
        }

        $this->listModel->delete($listId);
---
DELETE FROM "user_lists"
WHERE "id" IN (5)

    public function addItem(int $listId): ResponseInterface
    {
        if (! $this->listModel->belongsToUser($listId, $this->currentUserId())) {
            return $this->error('Lista no encontrada.', 404);
        }

        $rules = [
            'tmdb_id'    => 'required|integer|greater_than[0]',
            'media_type' => 'required|in_list[movie,tv]',
        ];

        $input = $this->request->getJSON(true) ?? $this->request->getPost();

        if (! $this->validateData($input ?? [], $rules)) {
            return $this->validationError($this->validator->getErrors());
        }

        $tmdbId    = (int) $input['tmdb_id'];
        $mediaType = $input['media_type'];

        // Ensure media_item exists locally (fetch from TMDB if not)
        $mediaItem = $this->mediaModel->findByTmdbId($tmdbId, $mediaType);

        if (! $mediaItem) {
            try {
                $tmdb      = new TMDBService();
                $detail    = $tmdb->getDetail($tmdbId, $mediaType);
                $mediaId   = $tmdb->storeMediaItem($detail, $mediaType);
                $mediaItem = $this->mediaModel->find($mediaId);
---
SELECT *
FROM "media_items"
WHERE "media_items"."id" = 1

            return $this->error('Este título ya está en la lista.', 409);
        }

        $itemId = $this->itemModel->insert([
            'list_id'       => $listId,
            'media_item_id' => $mediaItem['id'],
            'watched'       => false,
            'added_at'      => date('Y-m-d H:i:s'),
        ], true);

        $item = $this->itemModel->find($itemId);
---
INSERT INTO "list_items" ("list_id", "media_item_id", "watched", "added_at") VALUES (1, '1', FALSE, '2026-04-18 15:32:19')
SELECT *
FROM "list_items"
WHERE "list_items"."id" = 1

            return $this->error('No se proporcionaron campos para actualizar.', 400);
        }

        $this->itemModel->update($itemId, $updateData);
        return $this->success($this->itemModel->find($itemId), 'Item actualizado.');
---
UPDATE "list_items" SET "user_note" = 'Obra maestra', "user_rating" = 9.5, "watched" = TRUE
WHERE "list_items"."id" IN (1)
SELECT *
FROM "list_items"
WHERE "list_items"."id" = 1

    public function removeItem(int $listId, int $itemId): ResponseInterface
    {
        if (! $this->listModel->belongsToUser($listId, $this->currentUserId())) {
            return $this->error('Lista no encontrada.', 404);
        }

        if (! $this->itemModel->belongsToList($itemId, $listId)) {
            return $this->error('Item no encontrado en esta lista.', 404);
        }

        $this->itemModel->delete($itemId);
---
DELETE FROM "list_items"
WHERE "id" IN (1)