app/Controllers/Api/UserController.php

    public function me(): ResponseInterface
    {
        $user = $this->userModel->find($this->currentUserId());
---
SELECT *
FROM "users"
WHERE "users"."id" = 1

    public function update($id = null): ResponseInterface
    {
        $userId = $this->currentUserId();

        $rules = [
            'name'       => 'permit_empty|min_length[2]|max_length[150]',
            'email'      => "permit_empty|valid_email|max_length[255]|is_unique[users.email,id,{$userId}]",
            'avatar_url' => 'permit_empty|valid_url|max_length[500]',
        ];

        $input = $this->request->getJSON(true) ?? $this->request->getRawInput();

        if (! $this->validateData($input ?? [], $rules)) {
            return $this->validationError($this->validator->getErrors());
        }

        $updateData = [];
        if (isset($input['name']))       $updateData['name']       = trim($input['name']);
        if (isset($input['email']))      $updateData['email']      = strtolower(trim($input['email']));
        if (isset($input['avatar_url'])) $updateData['avatar_url'] = $input['avatar_url'];

        if (empty($updateData)) {
            return $this->error('No se proporcionaron campos para actualizar.', 400);
        }

        $this->userModel->update($userId, $updateData);

        $user = $this->userModel->find($userId);
---
UPDATE "users" SET "name" = 'Nuevo Nombre', "updated_at" = '2026-04-18 15:44:32'
WHERE "users"."id" IN (1)
SELECT *
FROM "users"
WHERE "users"."id" = 1