app/Models/ListItemModel.php

    public function getByListId(int $listId): array
    {
        return $this->db->table('list_items li')
            ->select('li.*, mi.tmdb_id, mi.media_type, mi.title, mi.overview, mi.poster_path, mi.backdrop_path, mi.release_date, mi.vote_average, mi.genres')
            ->join('media_items mi', 'mi.id = li.media_item_id')
            ->where('li.list_id', $listId)
            ->orderBy('li.added_at', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT "li".*, "mi"."tmdb_id", "mi"."media_type", "mi"."title", "mi"."overview", "mi"."poster_path", "mi"."backdrop_path", "mi"."release_date", "mi"."vote_average", "mi"."genres"
FROM "list_items" "li"
JOIN "media_items" "mi" ON "mi"."id" = "li"."media_item_id"
WHERE "li"."list_id" = 1
ORDER BY "li"."added_at" DESC

    public function existsInList(int $listId, int $mediaItemId): bool
    {
        return $this->where('list_id', $listId)
                    ->where('media_item_id', $mediaItemId)
                    ->countAllResults() > 0;
---
SELECT COUNT(*) AS "numrows"
FROM "list_items"
WHERE "list_id" = 1
AND "media_item_id" = 1

    public function belongsToList(int $itemId, int $listId): bool
    {
        return $this->where('id', $itemId)
                    ->where('list_id', $listId)
                    ->countAllResults() > 0;
---
SELECT COUNT(*) AS "numrows"
FROM "list_items"
WHERE "id" = 1
AND "list_id" = 1