app/Models/MediaItemModel.php

    public function findByTmdbId(int $tmdbId, string $mediaType): ?array
    {
        $item = $this->where('tmdb_id', $tmdbId)
                     ->where('media_type', $mediaType)
                     ->first();
---
SELECT *
FROM "media_items"
WHERE "tmdb_id" = 27205
AND "media_type" = 'movie'
 LIMIT 1

    public function upsert(array $data): int|string
    {
        $data['genres']   = is_array($data['genres'])   ? json_encode($data['genres'])   : ($data['genres'] ?? '[]');
        $data['raw_data'] = is_array($data['raw_data']) ? json_encode($data['raw_data']) : ($data['raw_data'] ?? '{}');

        $existing = $this->where('tmdb_id', $data['tmdb_id'])
                         ->where('media_type', $data['media_type'])
                         ->first();
---
SELECT *
FROM "media_items"
WHERE "tmdb_id" = 27205
AND "media_type" = 'movie'
 LIMIT 1

    public function paginated(int $page = 1, int $perPage = 20): array
    {
        $offset = ($page - 1) * $perPage;
        $items  = $this->orderBy('cached_at', 'DESC')
                       ->findAll($perPage, $offset);
---
SELECT *
FROM "media_items"
ORDER BY "cached_at" DESC
 LIMIT 20

    public function popular(int $limit = 20): array
    {
        $items = $this->orderBy('vote_average', 'DESC')
                      ->findAll($limit);
---
SELECT *
FROM "media_items"
ORDER BY "vote_average" DESC
 LIMIT 20