app/Models/RefreshTokenModel.php

UPDATE "refresh_tokens" SET "revoked" = TRUE
WHERE "token_hash" = '9354db17efb7ae974fe44e89b58e495537963e9e82504d7414bdc7eb60a4f0a6'
---
    public function revoke(string $tokenHash): void
    {
        $this->where('token_hash', $tokenHash)->set(['revoked' => true])->update();