app/Models/TmdbCacheModel.php

    public function getValid(string $cacheKey): ?array
    {
        $entry = $this->where('cache_key', $cacheKey)
                      ->where('expires_at >', date('Y-m-d H:i:s'))
                      ->first();
---
SELECT *
FROM "tmdb_cache"
WHERE "cache_key" = '44928414f8c796b0a15ab78d0b61ca26fe0a6283f09eb922d4378be6e8770a24'
AND "expires_at" > '2026-04-18 15:32:19'
 LIMIT 1

    public function store(string $cacheKey, string $endpoint, array $response, int $ttlSeconds): void
    {
        $expiresAt = date('Y-m-d H:i:s', time() + $ttlSeconds);
        $payload   = [
            'cache_key'  => $cacheKey,
            'endpoint'   => $endpoint,
            'response'   => json_encode($response),
            'expires_at' => $expiresAt,
            'created_at' => date('Y-m-d H:i:s'),
        ];

        $existing = $this->where('cache_key', $cacheKey)->first();

        if ($existing) {
            $this->update($existing['id'], $payload);
        } else {
            $this->insert($payload);
---
SELECT *
FROM "tmdb_cache"
WHERE "cache_key" = '44928414f8c796b0a15ab78d0b61ca26fe0a6283f09eb922d4378be6e8770a24'
 LIMIT 1
INSERT INTO "tmdb_cache" ("cache_key", "endpoint", "response", "expires_at", "created_at") VALUES ('9d379abbe1eff12bf8a6e3c8a04acc7e6e815906f044ddc5d76215121f61b17d', 'catalog:popular', '{"items":[]}', '2026-04-18 15:39:58', '2026-04-18 14:39:58')