app/Models/UserListModel.php

SELECT *
FROM "user_lists"
WHERE "user_lists"."id" = 1
---
    public function getWithItems(int $listId): ?array
    {
        $list = $this->find($listId);

SELECT COUNT(*) AS "numrows"
FROM "user_lists"
WHERE "id" = 1
AND "user_id" = 1
---
    public function belongsToUser(int $listId, int $userId): bool
    {
        return $this->where('id', $listId)
                    ->where('user_id', $userId)
                    ->countAllResults() > 0;