app/Models/UserModel.php

    public function findByEmail(string $email): ?array
    {
        return $this->where('email', $email)->first();
---
SELECT *
FROM "users"
WHERE "email" = 'demo@example.com'
 LIMIT 1